[
    {
        "id": 1,
        "img": "pasta.jpg",
        "name": "Classic Spaghetti Bolognese",
        "short_description": "A delicious and hearty Italian pasta dish.",
        "ingredients": [
          "400g spaghetti",
          "500g ground beef",
          "1 onion, finely chopped",
          "2 cloves of garlic, minced",
          "400g canned diced tomatoes",
          "2 tablespoons tomato paste",
          "1 teaspoon dried oregano",
          "1 teaspoon dried basil",
          "Salt and pepper to taste",
          "Parmesan cheese, grated (for serving)"
        ],
        "instructions": [
          "Cook the spaghetti according to package instructions until al dente. Drain and set aside.",
          "In a large skillet, brown the ground beef over medium heat until cooked through. Remove excess fat if needed.",
          "Add the chopped onion and minced garlic to the skillet and sauté until the onion is translucent.",
          "Stir in the canned diced tomatoes, tomato paste, dried oregano, and dried basil. Season with salt and pepper to taste.",
          "Simmer the sauce over low heat for 20-30 minutes, allowing the flavors to meld together.",
          "Serve the spaghetti with the Bolognese sauce on top. Sprinkle with grated Parmesan cheese.",
          "Enjoy!"
        ]
      },
      {
        "id": 2,
        "name": "Chicken Stir-Fry",
        "img" : "stirfry.jpg",
        "short_description": "A quick and flavorful Asian-inspired dish.",
        "ingredients": [
          "2 chicken breasts, sliced",
          "2 tablespoons soy sauce",
          "2 tablespoons oyster sauce",
          "1 tablespoon sesame oil",
          "1 tablespoon vegetable oil",
          "1 bell pepper, sliced",
          "1 carrot, julienned",
          "1 small onion, sliced",
          "2 cloves of garlic, minced",
          "1-inch piece of ginger, grated",
          "Salt and pepper to taste",
          "Cooked rice (for serving)"
        ],
        "instructions": [
          "In a bowl, marinate the sliced chicken breasts in soy sauce and oyster sauce for 10-15 minutes.",
          "Heat sesame oil and vegetable oil in a wok or large skillet over high heat.",
          "Add the marinated chicken and stir-fry until cooked through. Remove from the wok and set aside.",
          "In the same wok, stir-fry the bell pepper, carrot, onion, garlic, and ginger until the vegetables are crisp-tender.",
          "Return the cooked chicken to the wok and toss everything together.",
          "Season with salt and pepper to taste.",
          "Serve the chicken stir-fry over cooked rice.",
          "Enjoy!"
        ]
      },
      {
        "id": 3,
        "name": "Classic Margherita Pizza",
        "img" : "pizza.jpg",
        "short_description": "A traditional Italian pizza topped with fresh tomatoes, mozzarella, and basil.",
        "ingredients": [
          "Pizza dough",
          "200g mozzarella cheese, sliced",
          "2-3 fresh tomatoes, sliced",
          "Fresh basil leaves",
          "Olive oil",
          "Salt and pepper to taste"
        ],
        "instructions": [
          "Preheat your oven to the highest temperature setting.",
          "Roll out the pizza dough into your desired shape and thickness.",
          "Place the rolled-out dough on a baking sheet or pizza stone.",
          "Drizzle olive oil over the dough and season with salt and pepper.",
          "Layer the mozzarella cheese slices evenly over the dough.",
          "Add the tomato slices on top of the cheese.",
          "Bake the pizza in the preheated oven for about 10-15 minutes or until the crust is golden and the cheese is melted and bubbly.",
          "Remove the pizza from the oven and garnish with fresh basil leaves.",
          "Slice and serve while hot.",
          "Enjoy!"
        ]
      },
      {
        "id": 4,
        "name": "California Roll Sushi",
        "img" : "sushi.jpg",
        "short_description": "A popular sushi roll filled with crab, avocado, and cucumber.",
        "ingredients": [
          "Sushi rice",
          "Nori (seaweed) sheets",
          "Imitation crab sticks",
          "1 ripe avocado, sliced",
          "1 cucumber, julienned",
          "Soy sauce",
          "Wasabi",
          "Pickled ginger"
        ],
        "instructions": [
          "Prepare sushi rice according to package instructions and let it cool.",
          "Place a sheet of nori on a bamboo sushi mat or a clean, damp kitchen towel.",
          "Wet your hands to prevent sticking and spread a thin layer of sushi rice over the nori, leaving a small border at the top.",
          "Arrange slices of avocado, crab sticks, and cucumber along the bottom third of the rice-covered nori.",
          "Using the bamboo mat or towel, tightly roll the sushi away from you, applying gentle pressure to keep it compact.",
          "Moisten the top border of the nori with water to seal the roll.",
          "Repeat the process to make additional rolls.",
          "Using a sharp knife, slice each roll into bite-sized pieces.",
          "Serve the California roll sushi with soy sauce, wasabi, and pickled ginger.",
          "Enjoy!"
        ]
      },
      {
        "id": 5,
        "name": "Classic Chocolate Chip Cookies",
        "img" : "cookies.jpg",
        "short_description": "Homemade cookies with gooey chocolate chips.",
        "ingredients": [
          "1 cup unsalted butter, softened",
          "1 cup granulated sugar",
          "1 cup brown sugar, packed",
          "2 large eggs",
          "1 teaspoon vanilla extract",
          "3 cups all-purpose flour",
          "1 teaspoon baking soda",
          "1/2 teaspoon salt",
          "2 cups chocolate chips"
        ],
        "instructions": [
          "Preheat your oven to 350°F (175°C) and line baking sheets with parchment paper.",
          "In a large bowl, cream together the softened butter, granulated sugar, and brown sugar until light and fluffy.",
          "Add the eggs one at a time, beating well after each addition. Stir in the vanilla extract.",
          "In a separate bowl, whisk together the flour, baking soda, and salt. Gradually add the dry ingredients to the butter mixture, mixing until just combined.",
          "Fold in the chocolate chips.",
          "Drop rounded tablespoons of cookie dough onto the prepared baking sheets, spacing them about 2 inches apart.",
          "Bake for 10-12 minutes or until the edges are golden brown.",
          "Allow the cookies to cool on the baking sheets for a few minutes, then transfer them to wire racks to cool completely.",
          "Enjoy these classic chocolate chip cookies with a glass of milk!"
        ]
      },
      {
        "id": 6,
        "name": "Beef Tacos",
        "img" : "tacos.jpg",
        "short_description": "Flavorful and satisfying beef tacos with a variety of toppings.",
        "ingredients": [
          "1 lb ground beef",
          "1 onion, finely chopped",
          "2 cloves of garlic, minced",
          "1 tablespoon chili powder",
          "1 teaspoon cumin",
          "1/2 teaspoon paprika",
          "Salt and pepper to taste",
          "Taco shells or tortillas",
          "Shredded lettuce",
          "Diced tomatoes",
          "Shredded cheese",
          "Sour cream",
          "Salsa",
          "Guacamole"
        ],
        "instructions": [
          "In a large skillet, cook the ground beef over medium heat until browned. Drain excess fat if necessary.",
          "Add the chopped onion and minced garlic to the skillet and sauté until the onion is translucent.",
          "Stir in the chili powder, cumin, paprika, salt, and pepper. Cook for an additional 2-3 minutes to allow the flavors to meld together.",
          "Warm the taco shells or tortillas according to package instructions.",
          "Fill each shell or tortilla with the cooked beef mixture.",
          "Top with shredded lettuce, diced tomatoes, shredded cheese, sour cream, salsa, and guacamole.",
          "Serve these delicious beef tacos hot and enjoy!"
        ]
      }
]